# n1 = int(input("Введите цифру 1: "))
# n2 = int(input("Введите цифру 2: "))
# n3 = int(input("Введите цифру 3: "))
# print(n1, n2, n3, sep="")

# n = int(input("Введите 4-х значное число: "))
# n1 = n // 1000
# n2 = (n - (n1*1000)) // 100
# n3 = ((n - (n1*1000)) - (n2*100)) // 10
# n4 = ((n - (n1*1000)) - (n2*100) - (n3*10)) 
# print("Произведение 4-х цифр = ", (n1*n2*n3*n4))

# n = input("Введите колличество метров: ")
# dcm = float(n) * 10
# sm = float(n) * 100
# mm = float(n) * 1000
# miles = float(n) * 0.00062
# print("В", n, "м.: ", int(dcm),"дециметров")
# print("\t", int(sm),"сантиметров")
# print("\t", int(mm),"миллиметров")
# print("\t", float(miles),"миль")

# n1 = int(input("Введите длину основания треугольника: "))
# n2 = int(input("Введите высоту треугольника: "))
# print("Площадь треугольника = ", (1/2*n1*n2))

n = int(input("Введите 4-х значное число: "))
n1 = n // 1000
n2 = (n - (n1*1000)) // 100
n3 = ((n - (n1*1000)) - (n2*100)) // 10
n4 = ((n - (n1*1000)) - (n2*100) - (n3*10)) 
print("Перевернем число: ", n4, n3, n2, n1, sep="")



