from random import randint
s1 = sorted([randint(1, 30) for i in range(5)])
s2 = sorted([randint(1, 30) for i in range(5)])
s3 = []
s4 = []
s5 = []
s6 = []
print("-----------------------------------------------------------")
print("Первый список:", s1)
print("Второй список:", s2)
print("-----------------------------------------------------------")
#-------------------------------------------------------
print("Два списка вместе:", s1 + s2)
#-------------------------------------------------------
for i in s2:
    if i not in s1:
        s3.append(i)
print("Элементы обоих списков без повторений:", s1 + s3)
#-------------------------------------------------------
for i in s1:
    if i in s2:
        s4.append(i)
print("Общие элементы 2-х списков:", s4)
#-------------------------------------------------------
for i in s1:
    if (i not in s2) and (i not in s5):
        s5.append(i)
for j in s2:
    if (j not in s1) and (j not in s5):
        s5.append(j)
print("Уникальные элементы каждого из списков:", s5)
#-------------------------------------------------------
min_max_1 = [min(s1), max(s1)]
min_max_2 = [min(s2), max(s2)]
print("Min и max элементы 1-го списка:", min_max_1)
print("Min и max элементы 2-го списка:", min_max_2)
#-------------------------------------------------------
print("-----------------------------------------------------------")
